"""
Создайте список чисел, вывести минимальный и максимальный элемент списка.
Заполнить список нулями и единицами, при этом данные значения чередуются, начиная с нуля.
Заполнить список нулями, кроме первого и последнего элементов, которые должны быть равны единице.
Определите, есть ли в списке повторяющиеся элементы, если да, то вывести на экран это значение.
"""

spisok=[x for x in range(100)]
print(min(spisok), max(spisok))



for i in range(100):
    if i%2==0:
        spisok[i]=0
    else:
        spisok[i]=1
print(spisok)




for i in range(100):
    if i==0 or i==len(spisok)-1:
        spisok[i]=1
    else:
        spisok[i]=0
print(spisok)



for i in set(spisok):
    if i in spisok:
        print("Есть повторяющийся элемент ",i)
    else:
        print("Нет такого элемента!")
